Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/office_of_the_court_of_appeal_civil.html.txt.tmx
Source language: en
Languages: ga

source: Office of the Court of Appeal – Civil
ga: Oifig na Cúirte Achomhairc – Sibhialta

source: The Office of the Court of Appeal for civil matters:
ga: Bíonn Oifig na Cúirte Achomhairc do ábhair shibhialta:

source: • Provides administrative support to the Court of Appeal
ga: • Ag cur tacaíocht riarthach ar fáil don Chúirt Achomhairc

source: • Processes civil appeals from decisions of the High Court
ga: • Ag próiseáil achomhairc ó chinneadh de chuid na hArd-Chúirte

source: Further information is available from the Office of the Court of Appeal for civil appeals
ga: Tá tuilleadh eolais ar fáil ó Oifig na Cúirte Achomhairc maidir le hachomhairc sibhialta
